app/Controllers/StudentController.php

    public function store()
    {
        try{


        helper(['form', 'url']);
        $studentModel = new StudentModel();

        $fileImage = $this->request->getFile('image');
        $fileDoc = $this->request->getFile('document');

        if ($fileImage && $fileImage->isValid() &&  !$fileImage->hasMoved()) {
            $imageName = $fileImage->getRandomName();
            $fileImage->move('uploads/', $imageName);
        } else {
            $imageName = null;
        }

        if ($fileDoc && $fileDoc->isValid()  && !$fileDoc->hasMoved()) {
            $docName = $fileDoc->getRandomName();
            $fileDoc->move('uploads/', $docName);
        } else {
            $docName = null;
        }

        $studentModel->save([
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone'),
            'father_name' => $this->request->getPost('father_name'),
            'mother_name' => $this->request->getPost('mother_name'),
            'dob' => $this->request->getPost('dob'),
            'image' => $imageName,
            'document' => $docName,
        ]);
---
INSERT INTO `students` (`name`, `email`, `phone`, `father_name`, `mother_name`, `dob`, `image`, `document`) VALUES ('Premlata Kumari', 'premlatakumari0606@gmail.com', '8102021621', 'kk', 'jj', '2025-02-11', '1740546438_a17c77b9c3ac1223c599.jpg', '1740546438_50102a31bfc7f89daab7.pdf')